# =========================================================
# API-C-01, API-C-02, API-C-03
# 正常レスポンス & レスポンス型 & 要素構造
# =========================================================
def test_get_categories_structure(client):

    response = client.get("/api/categories")
    # =====================================================
    # API-C-01 正常レスポンス
    # =====================================================
    assert response.status_code == 200

    data = response.json()

    # =====================================================
    # API-C-02 レスポンス型確認
    # =====================================================

    assert isinstance(data, list)

    # =====================================================
    # API-C-03 要素構造確認
    # =====================================================
    if len(data) > 0:
        category = data[0]

        # =========================================================
        # API-C-04 idフィールド存在
        # API-C-05 nameフィールド存在
        # =========================================================
        assert "id" in category
        assert "name" in category
